{
	"speeches": [
		{
			"movie": "Dead Poets Society ",
			"year": "1989",
			"character": "John Keating",
			"actor": "Robin Williams",
			"text": "They believe they're destined for great things, just like many of you, their eyes are full of hope, just like you. Did they wait until it was too late to make from their lives even one iota of what they were capable? Because, you see gentlemen, these boys are now fertilizing daffodils. But if you listen real close, you can hear them whisper their legacy to you. Go on, lean in. Listen, you hear it? – – Carpe – – hear it? – – Carpe, carpe diem, seize the day boys, make your lives extraordinary.",
			"image": "DeadPoets.jpg",
			"youtube": "vi0Lbjs5ECI",
			"imdb": "tt0097165"
		},
		{
			"movie": "Field of Dreams",
			"year": "1989",
			"character": "Terrence Mann",
			"actor": "James Earl Jones",
			"text": "Ray, people will come Ray. They'll come to Iowa for reasons they can't even fathom. They'll turn up your driveway not knowing for sure why they're doing it. They'll arrive at your door as innocent as children, longing for the past. Of course, we won't mind if you look around, you'll say. It's only $20 per person. They'll pass over the money without even thinking about it: for it is money they have and peace they lack. And they'll walk out to the bleachers; sit in shirtsleeves on a perfect afternoon. They'll find they have reserved seats somewhere along one of the baselines, where they sat when they were children and cheered their heroes. And they'll watch the game and it'll be as if they dipped themselves in magic waters. The memories will be so thick they'll have to brush them away from their faces. People will come Ray. The one constant through all the years, Ray, has been baseball. America has rolled by like an army of steamrollers. It has been erased like a blackboard, rebuilt and erased again. But baseball has marked the time. This field, this game: it's a part of our past, Ray. It reminds of us of all that once was good and it could be again. Oh… people will come Ray. People will most definitely come.",
			"image": "FieldOfDreams.jpg",
			"youtube": "7SB16il97yw",
			"imdb": "tt0097351"
		},
		{
			"movie": "Hoosiers",
			"year": "1986",
			"character": "Coach Norman Dale",
			"actor": "Gene Hackman",
			"text": "I'm sure going to the State finals is beyond your wildest dreams, so let's just keep it right there. Forget about the crowds, the size of the school, their fancy uniforms, and remember what got you here. Focus on the fundamentals that we've gone over time and time again. And most important, don't get caught up thinking about winning or losing this game. If you put your effort and concentration into playing to your potential, to be the best that you can be, I don't care what the scoreboard says at the end of the game, in my book we're gonna be winners!",
			"image": "Hoosiers.jpg",
			"youtube": "H5ZBOL3M6B0",
			"imdb": "tt0091217"
		},
		{
			"movie": "Wall Street",
			"year": "1987",
			"character": "Gordon Gekko",
			"actor": "Michael Douglas",
			"text": "The new law of evolution in corporate America seems to be survival of the unfittest. Well, in my book you either do it right or you get eliminated. …The point is, ladies and gentleman, that greed, for lack of a better word, is good. Greed is right, greed works. Greed clarifies, cuts through, and captures the essence of the evolutionary spirit. Greed, in all of its forms; greed for life, for money, for love, knowledge has marked the upward surge of mankind. And greed, you mark my words, will not only save Teldar Paper, but that other malfunctioning corporation called the USA. Thank you very much.",
			"image": "WallStreet.jpg",
			"youtube": "VVxYOQS6ggk",
			"imdb": "tt0094291"
		},
		{
			"movie": "UHF",
			"year": "1989",
			"character": "Stanley Spadowski",
			"actor": "Michael Richards",
			"text": "This is my new mop. George, my friend, he gave me this mop. This is a pretty good mop. It's not as good as my first mop. I miss my first mop, but this is still a good mop. Sometimes you just hafta take what life gives ya, 'cause life is like a mop and sometimes life gets full of dirt and crud and bugs and hairballs and stuff… you, you, you gotta clean it out. You, you, you gotta put it in here and rinse it off and start all over again and, and sometimes, sometimes life sticks to the floor so bad you know a mop, a mop, it's not good enough, it's not good enough. You, you gotta get down there, like, with a toothbrush, you know, and you gotta, you gotta really scrub 'cause you gotta get it off. You gotta really try to get it off. But if that doesn't work, that doesn't work, you can't give up. You gotta, you gotta stand right up. You, you gotta run to a window and say, 'Hey! These floors are dirty as hell, and I'm not gonna take it any more!'",
			"image": "UHF.jpg",
			"youtube": "tHe6ar-X2cQ",
			"imdb": "tt0098546"
		},
		{
			"movie": "Revenge of the Nerds",
			"year": "1984",
			"character": "Gilbert Lowe",
			"actor": "Anthony Edwards",
			"text": "I just wanted to say that I'm a nerd, and I'm here tonight to stand up for the rights of other nerds. I mean uh, all our lives we've been laughed at and made to feel inferior. And tonight, those bastards, they trashed our house. Why? Cause we're smart? Cause we look different? Well, we're not. I'm a nerd, and uh, I'm pretty proud of it… Just join us 'cause uh, no-one's gonna really be free until nerd persecution ends.",
			"image": "RevengeOfTheNerds.jpg",
			"youtube": "kIZH5TKnEeg",
			"imdb": "tt0088000"
		},
		{
			"movie": "The Empire Strikes Back",
			"year": "1980",
			"character": "Yoda",
			"actor": "Frank Oz",
			"text": "Size matters not. Look at me. Judge me by my size, do you? Hmm? Hmm. And well you should not. For my ally is the Force, and a powerful ally it is. Life creates it, makes it grow. Its energy surrounds us and binds us. Luminous beings are we, not this crude matter. You must feel the Force around you; here, between you, me, the tree, the rock, everywhere, yes. Even between the land and the ship.",
			"image": "TheEmpireStrikesBack.jpg",
			"youtube": "Mp0axH5MsfY",
			"imdb": "tt0080684"
		},
		{
			"movie": "The Goonies",
			"year": "1985",
			"character": "Mikey Walsh",
			"actor": "Sean Astin",
			"text": "Don't you realize? The next time you see sky, it'll be over another town. The next time you take a test, it'll be in some other school. Our parents, they want the best of stuff for us. But right now, they got to do what's right for them. Because it's their time. Their time! Up there! Down here, it's our time. It's our time down here.",
			"image": "FGoonies.jpg",
			"youtube": "0atATbXbQ9g",
			"imdb": "tt0089218"
		},
		{
			"movie": "Stripes",
			"year": "1981",
			"character": "John Winger",
			"actor": "Bill Murray",
			"text": "Cut it out! Cut it out! Cut it out! The hell's the matter with you? Stupid! We're all very different people. We're not Watusi. We're not Spartans. We're Americans, with a capital 'A', huh? You know what that means? Do ya? That means that our forefathers were kicked out of every decent country in the world. We are the wretched refuse. We're the underdog. We're mutts! Here's proof: his nose is cold! But there's no animal that's more faithful, that's more loyal, more loveable than the mutt. Who saw Old Yeller? Who cried when Old Yeller got shot at the end? (raises his hand) Nobody cried when Old Yeller got shot? I'm sure. (other hands are reluctantly raised) I cried my eyes out. So we're all dogfaces, we're all very, very different, but there is one thing that we all have in common: we were all stupid enough to enlist in the Army. We're mutants. There's something wrong with us, something very, very wrong with us. Something seriously wrong with us – we're soldiers. But we're American soldiers! We've been kicking ass for 200 years! We're 10 and 1! Now we don't have to worry about whether or not we practiced. We don't have to worry about whether Captain Stillman wants to have us hung. All we have to do is to be the great American fighting soldier that is inside each one of us. Now do what I do, and say what I say. And make me proud.",
			"image": "Stripes.jpg",
			"youtube": "YXjqTyQuq4w",
			"imdb": "tt0083131"
		},
		{
			"movie": "Can't Buy Me Love",
			"year": "1987",
			"character": "Ronald Miller",
			"actor": "Patrick Dempsey",
			"text": "Nerds, jocks. My side, your side. It's all bulls**t. Its hard enough just trying to be yourself.",
			"image": "CantBuyMeLove.jpg",
			"youtube": "vujUJDKOkAc",
			"imdb": "tt0092718"
		}
	]
}